app/controllers/home_controller.rb

def index

  $short_count = ShortUrl.count
---
SELECT COUNT(*) FROM "short_urls"