app/controllers/home_controller.rb

  def index
    if $id.present?
      user = ShortUrl.where(user_id: $id).count
---
SELECT COUNT(*) FROM "short_urls" WHERE "short_urls"."user_id" = $1  [["user_id", 29]]

  def view
    if $id.present?
      @page = params.fetch(:page, 0).to_i
      @short_url = ShortUrl.where(user_id: $id).paginate(page: params[:page], per_page: 15)
      urls = ShortUrl.where(user_id: $id)
      @user_details = User.find_by(id: $id)
---
SELECT "short_urls".* FROM "short_urls" WHERE "short_urls"."user_id" = $1 ORDER BY "short_urls"."created_at" DESC LIMIT $2 OFFSET $3  [["user_id", 29], ["LIMIT", 15], ["OFFSET", 0]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]

  def show
    if $size.present?
      job_id = SecureRandom.uuid[0..2]
      0.upto($size - 1) do |n|
        $original_url = $multi_url[n]
        puts $multi_url[n]

        if $multi_url[n] =~ /\A#{URI::regexp(["http", "https"])}\z/&& ($multi_url[n] =~ /\A(?:http|https):\/\/.+\z/)


          @array = $original_url
          @display = "https://url-shortner-s7ah.onrender.com/"
          $string = SecureRandom.uuid[0..6]
          $original_url = $original_url
          $shortened_url = @display + $string
          short_url = ShortUrl.new(user_id: $id, original_url: $original_url, shortened_url: $shortened_url, job_id: job_id)

          if short_url.save
            @short_url = ShortUrl.where(job_id: job_id)
---
INSERT INTO "short_urls" ("original_url", "shortened_url", "created_at", "updated_at", "user_id", "job_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT "short_urls".* FROM "short_urls" WHERE "short_urls"."job_id" = $1  [["job_id", "70f"]]