app/controllers/user_controller.rb

  def check_login
    email = params[:email]
    pass = params[:password]
    @user = User.find_by(email: email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "arunantony9567@gmail.com"], ["LIMIT", 1]]

  def details
    if $id.present?
      @user_details = User.find_by(id: $id)
      urls = ShortUrl.where(user_id: $id)
      @last_url = urls.last
      @count = urls.count
      @most_repeated_data = urls.group(:original_url).count.max_by { |_, count| count }
      if @most_repeated_data != nil
        @repeated_url_list = urls.where(original_url: @most_repeated_data.first)
        @dates = urls.pluck("DATE(created_at)")
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
SELECT "short_urls".* FROM "short_urls" WHERE "short_urls"."user_id" = $1 ORDER BY "short_urls"."id" DESC LIMIT $2  [["user_id", 29], ["LIMIT", 1]]
SELECT COUNT(*) FROM "short_urls" WHERE "short_urls"."user_id" = $1  [["user_id", 29]]
SELECT "short_urls".* FROM "short_urls" WHERE "short_urls"."user_id" = $1 AND "short_urls"."original_url" = $2 ORDER BY "short_urls"."created_at" DESC  [["user_id", 29], ["original_url", "https://google.com"]]
SELECT COUNT(*) AS "count_all", "short_urls"."original_url" AS "short_urls_original_url" FROM "short_urls" WHERE "short_urls"."user_id" = $1 GROUP BY "short_urls"."original_url"  [["user_id", 29]]
SELECT DATE(created_at) FROM "short_urls" WHERE "short_urls"."user_id" = $1  [["user_id", 29]]

  def delete_urls
    user = User.find_by(id: params[:id])
    delete_urls = ShortUrl.where(user_id: user.id)
    delete_files = UrlFile.where(user_id: user.id)
    delete_files.delete_all
    delete_urls.delete_all
    puts user.name
    puts delete_urls.count
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
DELETE FROM "url_files" WHERE "url_files"."user_id" = $1  [["user_id", 29]]
DELETE FROM "short_urls" WHERE "short_urls"."user_id" = $1  [["user_id", 29]]
SELECT COUNT(*) FROM "short_urls" WHERE "short_urls"."user_id" = $1  [["user_id", 29]]

  def delete_urls_confirm
    user = User.find_by(id: params[:id])
    delete_urls = ShortUrl.where(user_id: user.id)
    delete_files = UrlFile.where(user_id: user.id)
    redirect_to "/user/details", confirm: "This will delete #{delete_files.count} Files and #{delete_urls.count} urls"
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
SELECT COUNT(*) FROM "short_urls" WHERE "short_urls"."user_id" = $1  [["user_id", 29]]
SELECT COUNT(*) FROM "url_files" WHERE "url_files"."user_id" = $1  [["user_id", 29]]